Revit 2024 API
DuctFittingAndAccessoryConnectorData.Angle Property
 the angle of the fitting, Units:(rad).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Angle { get; }
Visual Basic
Public ReadOnly Property Angle As Double
	Get
Visual C++
public:
property double Angle {
	double get ();
}
See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace